      *================================================================*
       IDENTIFICATION                                DIVISION.
      *================================================================*
       PROGRAM-ID. PROGRA001.
       AUTHOR.     EDWIN PEREIRA OLIVEIRA LIMA.
      *================================================================*
      ***********************DOCUMENTACAO*******************************
      ******************************************************************
      *>                                              NOME DA EMPRESA <*
      *> DATA.: 22/09/2020                                            <*
      *> ANALISTA.: EDWIN PEREIRA OLIVEIRA LIMA                       <*
      *> OBJETIVO.:                                                   <*
      *>              ESSE PROGRAMA RECEBE VALOR E IMPRIME NO CONSOLE <*
      *>                                                              <*
      *>                                                              <*
      *>                                                              <*
      ******************************************************************
      *********************FIN DOCUMENTACAO*****************************
      *================================================================*
       ENVIRONMENT                                   DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       CONFIGURATION                         SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
      *----------------------------------------------------------------*
       INPUT-OUTPUT                          SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.

      *================================================================*
       DATA                                          DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                                  SECTION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE                       SECTION.
      *----------------------------------------------------------------*
       77 WRK-SALDO        PIC 9(10) VALUE ZEROS.
       77 WRK-RESULTADO    PIC 9(10) VALUE ZEROS.
       77 WRK-VALOR        PIC 9(10) VALUE 51.
       77 WRK-RESTO        PIC 9(10) VALUE ZEROS.



      *
      *================================================================*
       PROCEDURE                                     DIVISION.
      *================================================================*
      *    WRK-RESULTADO = WRK-VALOR / 2
      *        DIVSOR    DIVIDENDO
      *    DIVIDE 2 INTO WRK-VALOR GIVING WRK-RESULTADO
      *           DIVIDENDO   DIVISOR
           DIVIDE WRK-VALOR BY 2 GIVING WRK-RESULTADO
      *    Comando que pega o RESTO da divisao
           REMAINDER WRK-RESTO

           DISPLAY WRK-RESULTADO ' Resto da Divisao : ' WRK-RESTO
           STOP RUN.
